benchmark_report/wrk_results_27249/wrk_100concurrent.txt
Running 30s test @ http://localhost:18080
  12 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.70ms   91.44ms 962.77ms   97.50%
    Req/Sec   643.74     72.11   818.00     69.84%
  Latency Distribution
     50%   12.24ms
     75%   13.62ms
     90%   15.35ms
     99%  626.13ms
  232055 requests in 31.05s, 21.25MB read
Requests/sec:   7474.11
Transfer/sec:    700.70KB